// Task #2
// Создать функцию которая спрашивает ваши данные а потом выводит их в html документ. 
// Найти в интернете значение тегов <hr />.

var firstName;
var lastName;
var age;

function ask() {
  firstName = prompt("Введите свое имя:");//записали значение глобальной переменной
  lastName = prompt("Введите свою фамилию:");//записали значение глобальной переменной
  age = prompt("Введите свой возраст:");//записали значение глобальной переменной
}

function say() {
  document.write("Имя: " + firstName + "<br />");//вызвали значение глобальной переменной
  document.write("Фамилия: " + lastName + "<br />");//вызвали значение глобальной переменной
  document.write("Возраст: " + age + "<br />");//вызвали значение глобальной переменной
  document.write("<hr/>");
}

// Вызов функций.
ask();
say();

// <hr /> - цей тег малює горизонтальну лінію, яка за своїм виглядом залежить від параметрів, 
// що використовуються, а також браузера. Тег <hr> відноситься до блокових елементів, 
// лінія завжди починається з нового рядка, а після неї всі елементи відображаються на наступному рядку.

